In [1]:
import pandas as pd
obj=pd.Series([2,1,5,4,0.6,-4])
print(obj)

0    2.0
1    1.0
2    5.0
3    4.0
4    0.6
5   -4.0
dtype: float64

In [3]:
obj=pd.Series([2,3,1,5,6,3],index=['a','b','c','y','h','k'])
print(obj)
print(obj.values)#it return value
print(obj.index)

a    2
b    3
c    1
y    5
h    6
k    3
dtype: int64
[2 3 1 5 6 3]
Index(['a', 'b', 'c', 'y', 'h', 'k'], dtype='object')

In [9]:
print(obj['h'])
print(obj[['a','c','k']])

6
a    2
c    1
k    3
dtype: int64

In [10]:
print(obj[obj>2])#it returns value which greater then 2

b    3
y    5
h    6
k    3
dtype: int64

In [11]:
print(obj*3)

a     6
b     9
c     3
y    15
h    18
k     9
dtype: int64

In [14]:
print('b' in obj)
print('d' in obj)

True
False

In [2]:
data={'ohio':3,
      'texas':4,
      'Hamra':5
     }
print(pd.Series(data))

ohio     3
texas    4
Hamra    5
dtype: int64

In [3]:
state=['ohio','Sugar','Hamra','Lemon']#there is ohio and Hamra match data and other does not
ob1=pd.Series(data,index=state)
ob1

ohio     3.0
Sugar    NaN
Hamra    5.0
Lemon    NaN
dtype: float64

In [24]:
print(pd.isnull(ob1))#sugar and Lemon is null because there is no Value

ohio     False
Sugar     True
Hamra    False
Lemon     True
dtype: bool

In [4]:
data={
    'ohio':1200,
    'texas':200,
    'Hamra':100
}
obj1=pd.Series(data)
print(obj1)
data1={
    'ohio':100,
    'texas':200,
    'Hamra':230,
    'lara' :2000
}
obj2=pd.Series(data1)
print(obj2)
print("After Addition")
obj1+obj2

ohio     1200
texas     200
Hamra     100
dtype: int64
ohio      100
texas     200
Hamra     230
lara     2000
dtype: int64
After Addition

Hamra     330.0
lara        NaN
ohio     1300.0
texas     400.0
dtype: float64

In [17]:
obj2.name='population' #updated
obj2

ohio     100
texas    200
Hamra    230
Name: population, dtype: int64

In [18]:
obj2.index.name='States' #Create index
obj2

States
ohio     100
texas    200
Hamra    230
Name: population, dtype: int64

In [22]:
obj #Create above
obj.index=['Texas','ohio','Karela','Us','naka','tap'] #list
obj

Texas     2.0
ohio      1.0
Karela    5.0
Us        4.0
naka      0.6
tap      -4.0
dtype: float64

DATA FRAME

In [5]:
Data={
    'state':['Karachi','Lahore',"faisalabad","Rawalpindi"],#Arrays length must be same
    'Year':[2018,2019,2020,2021],
    'POp':[1.2,1.2,3.4,5.4]
}
frame=pd.DataFrame(Data)
frame

        state  Year  POp
0     Karachi  2018  1.2
1      Lahore  2019  1.2
2  faisalabad  2020  3.4
3  Rawalpindi  2021  5.4

In [6]:
pd.DataFrame(Data,columns=['state','POp','Year']) #columns name as you want

        state  POp  Year
0     Karachi  1.2  2018
1      Lahore  1.2  2019
2  faisalabad  3.4  2020
3  Rawalpindi  5.4  2021

In [7]:
frame2=pd.DataFrame(Data,columns=['Year','state','POp','debt'],index=['a','b',"c",'d'])
frame2

   Year       state  POp debt
a  2018     Karachi  1.2  NaN
b  2019      Lahore  1.2  NaN
c  2020  faisalabad  3.4  NaN
d  2021  Rawalpindi  5.4  NaN

In [33]:
frame2.columns

Index(['Year', 'state', 'POp'], dtype='object')

In [34]:
frame2.state

a       Karachi
b        Lahore
c    faisalabad
d    Rawalpindi
Name: state, dtype: object

In [35]:
frame2.Year

a    2018
b    2019
c    2020
d    2021
Name: Year, dtype: int64

In [10]:
frame2.loc['b'] # it gives row wise data and accept index

Year       2019
state    Lahore
POp         1.2
Name: b, dtype: object

In [13]:
frame2['debt']=16.5 # update value
frame2

   Year       state  POp  debt
a  2018     Karachi  1.2  16.5
b  2019      Lahore  1.2  16.5
c  2020  faisalabad  3.4  16.5
d  2021  Rawalpindi  5.4  16.5

In [8]:
import numpy as np
frame2['debt']=np.arange(4)
frame2

   Year       state  POp  debt
a  2018     Karachi  1.2     0
b  2019      Lahore  1.2     1
c  2020  faisalabad  3.4     2
d  2021  Rawalpindi  5.4     3

In [9]:
val=pd.Series([2.3,5.6,7.9],index=["a","d","c"]) #updating value with the help of index using Series 
frame2['debt']=val
frame2

   Year       state  POp  debt
a  2018     Karachi  1.2   2.3
b  2019      Lahore  1.2   NaN
c  2020  faisalabad  3.4   7.9
d  2021  Rawalpindi  5.4   5.6

In [12]:
frame2['eastern']=frame2.state=='Karachi' #check which time karachi
frame2

   Year       state  POp  debt  eastern
a  2018     Karachi  1.2   2.3     True
b  2019      Lahore  1.2   NaN    False
c  2020  faisalabad  3.4   7.9    False
d  2021  Rawalpindi  5.4   5.6    False

In [13]:
del frame2['eastern'] #dellete column eastern

In [14]:
frame2.columns #returns columns

Index(['Year', 'state', 'POp', 'debt'], dtype='object')

In [30]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, #Matching index
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3=pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [18]:
frame3.T #Return transpose

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [33]:
pd.DataFrame(pop,index=[2001,2002,2003]) #updating index

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [39]:
pdata={
    'Ohio':frame3['Ohio'][:-1],
    'Nevada':frame3["Nevada"][:]
}

In [40]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   NaN     NaN
2001   1.7     2.4
2002   3.6     2.9

In [43]:
frame3.index.name='year';frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [49]:
frame3.aggregate('Ohio')

year
2001    1.7
2002    3.6
2000    1.5
Name: Ohio, dtype: float64

In [51]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])